Тест/Тест/src/Documents/СписаниеТМЦ/СписаниеТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеТМЦ</name>
  <registerRecords>AccumulationRegister.ДвижениеТМЦ</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучения</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСписания</name>
    <type>
      <types>EnumRef.ВидыСписания</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладСписания</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоступлениеТМЦ</name>
    <type>
      <types>DocumentRef.ПоступлениеТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТМЦ</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТМЦ</name>
      <type>
        <types>CatalogRef.СкладСнабжение</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Стеллаж</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТМЦПоНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>CatalogRef.ИнвентарныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Catalogs/ИнвентарныеНомера/ИнвентарныеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнвентарныеНомера</name>
  <owners>Catalog.СкладСнабжение</owners>
  <owners>Catalog.ТМЦВорктрак</owners>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.ПоступлениеЗапчастей</types>
      <types>DocumentRef.ПоступлениеТМЦВорктрак</types>
      <types>DocumentRef.ПоступлениеТМЦ</types>
      <types>DocumentRef.ПоступлениеТМЦСкладСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИнвентарногоНомераТМЦ</name>
    <type>
      <types>EnumRef.СтатусыИнвентарныхНомеровТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопКомментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IMEI</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тест/Тест/src/Documents/СписаниеТМЦ/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СписокТМЦТМЦПриИзменении(Элемент)
	
	ТекСтрока = Элементы.СписокТМЦ.ТекущиеДанные;
	ТМЦПоНакладной = ПолучитьТМЦПоНакладнойНаСервере(ТекСтрока.ТМЦ);
	
	Если НЕ ЗначениеЗаполнено(ТекСтрока.Количество) Тогда
		ТекСтрока.Количество = 1;
	КонецЕсли;
	ТекСтрока.Склад 		 = Объект.СкладСписания;
	ТекСтрока.цена       	 = ПолучениеЦены(ТекСтрока.ТМЦ);
	ТекСтрока.Код        	 = ПолучениеКода(ТекСтрока.ТМЦ);
	ТекСтрока.ТМЦПоНакладной = ТМЦПоНакладной; 
	ОбработкаИзмененияСтроки("СписокТМЦ", "Цена");
	
	/////+ГомзМА 13.04.2023
	//ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("СправочникСсылка.ИнвентарныеНомера"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.Использование = Истина;
	//ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//ЭлементОтбора.ПравоеЗначение = ТекСтрока.ТМЦ;
	/////-ГомзМА 13.04.2023
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияСтроки(ИмяТабличнойЧасти, Поле = Неопределено, ДанныеСтроки = Неопределено)
	
	ТекДанные = ?(ДанныеСтроки = Неопределено, Элементы[ИмяТабличнойЧасти].ТекущиеДанные, ДанныеСтроки);
	
	Если Поле = "Сумма" Тогда
		Если ТекДанные.Количество <> 0 Тогда
			ТекДанные.Цена = ТекДанные.Сумма / ТекДанные.Количество;
		КонецЕсли;	
	Иначе	
		ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаИзмененияСтроки()



&НаСервере
Функция  ПолучениеЦены(ТМЦ)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СкладСнабжение.Стоимость КАК Стоимость
	               |ИЗ
	               |	Справочник.СкладСнабжение КАК СкладСнабжение
	               |ГДЕ
	               |	СкладСнабжение.Ссылка = &Ссылка";
	запрос.УстановитьПараметр("Ссылка", ТМЦ);
	Выборка = запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.стоимость;
КонецФункции

&НаКлиенте
Процедура СписокТМЦЦенаПриИзменении(Элемент)
		ОбработкаИзмененияСтроки("СписокТМЦ", "Цена");
КонецПроцедуры

&НаКлиенте
Процедура СписокТМЦКоличествоПриИзменении(Элемент)
	ОбработкаИзмененияСтроки("СписокТМЦ", "Количество");
КонецПроцедуры

&НаСервере
Функция  ПолучениеКода(ТМЦ)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СкладСнабжение.Код КАК код
	               |ИЗ
	               |	Справочник.СкладСнабжение КАК СкладСнабжение
	               |ГДЕ
	               |	СкладСнабжение.Ссылка = &Ссылка";
	запрос.УстановитьПараметр("Ссылка", ТМЦ);
	Выборка = запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.код;
КонецФункции


&НаСервере
Функция ПолучитьТМЦПоНакладнойНаСервере(ТекДанные)

	///+ГомзМА 10.04.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладСнабжение.ТМЦПоНакладной КАК ТМЦПоНакладной
		|ИЗ
		|	Справочник.СкладСнабжение КАК СкладСнабжение
		|ГДЕ
		|	СкладСнабжение.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекДанные);
	
	ТМЦПоНакладной = Запрос.Выполнить().Выбрать();
	
	ТМЦПоНакладной.Следующий();
	
	Возврат ТМЦПоНакладной.ТМЦПоНакладной;
	///-ГомзМА 10.04.2023
	
КонецФункции 

&НаСервере
Процедура ВидСписанияПриИзмененииНаСервере()
	
	Если Объект.ВидСписания = Перечисления.ВидыСписания.НаЧеловека Тогда
		Элементы.Получатель.Видимость = Истина;
	Иначе
		Элементы.Получатель.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВидСписанияПриИзменении(Элемент)
	ВидСписанияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписокТМЦИнвентарныйНомерПриИзмененииНаСервере()
	
	///
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТМЦИнвентарныйНомерПриИзменении(Элемент)
	
	//СписокТМЦИнвентарныйНомерПриИзмененииНаСервере();
	
	///+ГомзМА 13.04.2023
	ТекСтрока = Элементы.СписокТМЦ.ТекущиеДанные;
	
	//Заполнение данных по инвентарному номеру
	СерийныйНомер = ПолучитьСерийныйНомер(ТекСтрока.ИнвентарныйНомер);
	//ТМЦ = ПолучитьТМЦ(ТекСтрока.ИнвентарныйНомер);
	//ТМЦПоНакладной = ПолучитьТМЦПоНакладной(ТекСтрока.ИнвентарныйНомер);
	
	ТекСтрока.СерийныйНомер  = СерийныйНомер;
	//ТекСтрока.ТМЦ 			 = ТМЦ;
	//ТекСтрока.ТМЦПоНакладной = ТМЦПоНакладной;
	
	////Заполнение данных по ТМЦ
	//ТекСтрока.Количество 	 = 1;
	//ТекСтрока.Склад 		 = Объект.СкладСписания;
	//ТекСтрока.Цена       	 = ПолучениеЦены(ТекСтрока.ТМЦ);
	//ТекСтрока.Код        	 = ПолучениеКода(Текстрока.ТМЦ);
	//ТекСтрока.ТМЦПоНакладной = ТМЦПоНакладной; 
	//ОбработкаИзмененияСтроки("СписокТМЦ", "Цена");
	///-ГомзМА 13.04.2023
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСерийныйНомер(ТекСтрокаИнвентарныйНомер)

	///+ГомзМА 13.04.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвентарныеНомера.СерийныйНомер КАК СерийныйНомер
		|ИЗ
		|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
		|ГДЕ
		|	ИнвентарныеНомера.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекСтрокаИнвентарныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.СерийныйНомер;
	///-ГомзМА 13.04.2023

КонецФункции


&НаСервере
Функция ПолучитьТМЦ(ТекСтрокаИнвентарныйНомер)

	///+ГомзМА 13.04.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвентарныеНомера.Владелец КАК Владелец
		|ИЗ
		|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
		|ГДЕ
		|	ИнвентарныеНомера.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекСтрокаИнвентарныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.Владелец;
	///-ГомзМА 13.04.2023

КонецФункции


&НаСервере
Функция ПолучитьТМЦПоНакладной(ТекСтрокаИнвентарныйНомер)

	///+ГомзМА 13.04.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвентарныеНомера.Владелец.ТМЦПоНакладной КАК ВладелецТМЦПоНакладной
		|ИЗ
		|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
		|ГДЕ
		|	ИнвентарныеНомера.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекСтрокаИнвентарныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.ВладелецТМЦПоНакладной;
	///-ГомзМА 13.04.2023

КонецФункции


&НаКлиенте
Процедура СписокТМЦИнвентарныйНомерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//ПараметрыОткрытия = Новый Структура();
	//
	//ОткрытьФорму("Справочник.ИнвентарныеНомера.ФормаВыбора", ПараметрыОткрытия, ЭтаФорма, ЭтаФорма.ПодчиненныеЭлементы.СписокТМЦ.ПодчиненныеЭлементы.СписокТМЦТМЦ); //ЭтаФорма.Владелец);
	
	ИнвентарныйНомерНачалоВыбора("СписокТМЦ", ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры


&НаКлиенте
Процедура ИнвентарныйНомерНачалоВыбора(ИмяТаблицы, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Владелец", ТекДанные.ТМЦ);

	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ДатаОстатков", ТекущаяДата());
	ПараметрыОткрытия.Вставить("Склад", ТекДанные.Склад);
	ПараметрыОткрытия.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	
	
	ОткрытьФорму("Справочник.ИнвентарныеНомера.ФормаВыбора", ПараметрыОткрытия, ЭтаФорма); 
	
КонецПроцедуры // ПартияНачалоВыбора()

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Элементы.СписокТМЦ.ТекущиеДанные.ИнвентарныйНомер =  ВыбранноеЗначение; ///Вернётся массив с выбранными значениями (Даже если значение только одно )
КонецПроцедуры


//&НаКлиенте
//Процедура ИнвентарныйНомерНачалоВыбора(ИмяТаблицы, ДанныеВыбора, СтандартнаяОбработка)
// 
//	СтандартнаяОбработка = Ложь;
//	
//	ТекДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
//	
//	ПараметрыОтбора = Новый Структура();
//	ПараметрыОтбора.Вставить("Владелец", ТекДанные.ТМЦ);

//	
//	ПараметрыОткрытия = Новый Структура();
//	ПараметрыОткрытия.Вставить("ДатаОстатков", ТекущаяДата());
//	ПараметрыОткрытия.Вставить("Склад", ТекДанные.Склад);
//	ПараметрыОткрытия.Вставить("Отбор", ПараметрыОтбора);
//	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);

//	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"ПодборРеализации");

//	ОткрытьФорму("Справочник.ИнвентарныеНомера.ФормаВыбора",ПараметрыОткрытия,
//	        ЭтаФорма, , , , ОбработкаВыбора);
//СтандартнаяОбработка = Истина;
//КонецПроцедуры

//&НаКлиенте  
//Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт

//    Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
//        Возврат;
//    КонецЕсли;
//     
//    Элементы.СписокТМЦ.ТекущиеДанные.ИнвентарныйНомер = Значение; ///Если Множественный Выбор - то вернется массив 
//    
//КонецПроцедуры
